Repository: ngm/standard
Catalog: standard/docs/locale/*/LC_MESSAGES/implementation/hosting.po
Languages: es

source: Data files, APIs and discovery
es: Archivos de datos, API y descubrimiento

source: Different users have different needs when it comes to accessing OCDS data.
es: Distintos usuarios tienen diferentes necesidades cuando se trata de acceder a los datos de OCDS.

source: [Data on the Web Best Practice #15](https://www.w3.org/TR/dwbp/#dataFormats) suggests that "Data should be available in multiple data formats" in order to increases the number of different users, tools and applications that can process the data.
es: [Los datos sobre La Mejores Prácticas en la Web # 15] (https://www.w3.org/TR/dwbp/#dataFormats) sugiere que "los datos deben estar disponibles en múltiples formatos de datos" con el fin de aumentar el número de usuarios diferentes, las herramientas y aplicaciones que pueden procesar estos datos.

source: Which formats are most important will depend on the priority use cases for each OCDS implementation, but you should consider:
es: La definición de qué formatos son los más importantes dependerá de los casos de uso prioritarios para cada implementación de OCDS, pero usted debe considerar:

source: **Bulk downloads** - packaging together multiple releases or multiple records in one or more files for users to download and import into local tools.
es: **Descargas masivas** - empaquetando varias entregas o múltiples registros en uno o más archivos para que los usuarios los descarguen e importen en las herramientas locales.

source: **Individual release and record downloads** - providing a URI at which each release or record can be obtained. This is crucial for 4 ☆ data publication.
es: **Entrega individual y descargas de registros** - proporcionando un URI en el cual puede obtenerse cada entrega o registro. Esto es crucial para el nivel 4 ☆ de publicación de datos.

source: **CSV and Spreadsheet serializations** - providing multiple releases or compiled records for download, enabling users to work with data directly in spreadsheet software or other tools.
es: **Serializaciones de CSV y Hojas de Cálculo** - proporcionando múltiples entregas o registros compilados para su descarga, permitiendo a los usuarios trabajar con datos directamente en un software de hoja de cálculo u otras herramientas.

source: **API access** - enabling interactive access to your data. OCDS does not currently provide a standard for constructing APIs, but [potential approaches can be discussed with the community here](https://github.com/open-contracting/standard/issues/290).
es: **Acceso a API** - habilitar el acceso interactivo a sus datos. El OCDS actualmente no proporciona un estándar para construir APIs, pero [los enfoques potenciales pueden ser discutidos con la comunidad aquí] (https://github.com/open-contracting/standard/issues/290).

source: Bulk downloads
es: Descargas masivas

source: The release and record data package containers (in JSON and CSV) offer a way to provide **bulk access** to a collection of contracting process release and records.
es: Los contenedores de datos de entregas y registros (en JSON y CSV) ofrecen una forma de proporcionar **acceso MASIVO** a una colección de entregas y registros de procesos de contratación.

source: However, very large files can be difficult for users to download and process. The following section provides suggested good practices which will assist users in accessing data. These are not requirements of the standard, but are based on experiences of maximising the number of users able to work with datasets with their existing hardware and software.
es: Sin embargo, los archivos muy grandes pueden ser difíciles de descargar y procesar. En la siguiente sección se ofrecen buenas prácticas sugeridas que ayudarán a los usuarios a acceder a estos datos. Estas prácticas no son requisitos del estándar, sino que se basan en experiencias para maximizar el número de usuarios capaces de trabajar con conjuntos de datos con hardware y software existentes.

source: File size limits
es: Límites de tamaño de archivo

source: When generating data packages for bulk download, apply the following limits:
es: Al generar paquetes de datos para descarga masiva, aplique los siguientes límites:

source: Unzipped OCDS data packages should not exceed 1Gb each;
es: Los paquetes de datos OCDS descomprimidos no deben exceder 1Gb cada uno;

source: Zipped OCDS data packages should not exceed 10 Mb each;
es: Los paquetes de datos OCDS comprimidos no deben superar los 10 Mb cada uno;

source: A single OCDS data package should contain a maximum of 250,000 awards or contracts;
es: Un único paquete de datos OCDS debe contener un máximo de 250.000 adjudicaciones o contratos;

source: When a file is likely to exceed one of these limits, release or records should be split across multiple files. Dynamically generated bulk downloads do not have to apply these limits, though publishers should consider ways to advise users when a query is likely to generate a very large file.
es: Cuando es probable que un archivo supere uno de estos límites, la entrega o los registros deben dividirse en varios archivos. Las descargas masivas generadas dinámicamente no tienen que aplicar estos límites, aunque los publicadores deben considerar formas de avisar a los usuarios cuando es altamente probable que una búsqueda genere un archivo muy grande.

source: Segmenting files
es: Segmentación de archivos

source: When the suggested limits require publication of multiple files, publishers should consider ways to split data across available files.
es: Cuando los límites sugeridos requieren la publicación de varios archivos, los publicadores deben considerar formas de dividir los datos entre los archivos disponibles.

source: For releases, publishers may choose to:
es: Para las entregas, los publicadores pueden elegir:

source: Segment by **releaseDate - **placing all the releases from a given day, month or year in the same file;
es: Segmento por **releaseDate - **colocando todas las entregas de un día, mes o año en el mismo archivo;

source: Segment by **contracting process identifier **- placing all the releases related to a given set of contract process identifiers together in the same data package;
es: Segmento por **identificador de proceso de contratación** - colocando todas las entregas relacionadas con un conjunto de identificadores de proceso de contrato juntos en el mismo paquete de datos;

source: For records, publishers should segment either based on the first **releaseDate** associated with a contracting process, or by **contracting process identifier.**
es: En el caso de los registros, los publicadores deben segmentar basándose en el primer **releaseDate** asociado a un proceso de contratación, o **el identificador del proceso de contratación**.

source: Following these approaches will avoid release and records 'jumping' between files when the bulk files are updated.
es: Seguir estos enfoques evitará los 'saltos' entre los archivos de entregas y registros cuando se actualicen los archivos masivos.

source: Compression
es: Compresión

source: OCDS data packages may be compressed in order to save on diskspace and bandwidth.
es: Los paquetes de datos de OCDS pueden comprimirse para ahorrar espacio de disco y de ancho de banda.

source: If compressing data packages, publishers *should* use the zip file format.
es: Si comprimen los paquetes de datos, los publicadores *deben* usar el formato de archivo zip.

source: Serving files
es: Servir archivos

source: Publishers should ensure that the web server providing access to bulk files correctly reports the [HTTP Last-Modified](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.29) header so that consuming applications only need to download updated files.
es: Los publicadores deben asegurarse de que el servidor web que proporciona acceso a los archivos para descargas masivas informe correctamente el encabezado [HTTP Last-Modified](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html#sec14.29) de modo que las aplicaciones solo necesiten descargar los archivos actualizados.

source: Individual releases and records
es: Entregas y registros individuales

source: To achieve [4 ☆](levels.md) ODCS publication requires each release and record to be accessible at a permanent URI. This may be achieved by:
es: Para lograr [4 ☆](levels.md) la publicación ODCS requiere que cada entrega y cada registro sea accesible en un URI permanente. Esto puede lograrse mediante:

source: (a) Archiving a single-release release package for each release to a web accessible file system as it is created, and then regularly merging these releases to compile individual record files in the same file system. One approach may be to have a folder for each ```ocid``` and to place the releases and record related to that process into that folder.
es: (a) Archivar un paquete de entrega única para cada entrega en un sistema de archivos accesible en la web a medida que se crea, y luego fusionar regularmente estas versiones para compilar archivos de registro individuales en el mismo sistema de archivos. Un enfoque puede ser tener una carpeta para cada ```ocid``` y colocar las entregas y registros relacionados con ese proceso en esa carpeta.

source: (b) Providing access to releases and records through an API.
es: (B) Proporcionar acceso a las entregas y registros a través de una API.

source: Note that the second approach will require the API to maintain a full revision history of each contracting process, so that releases from each stage of a contracting process can be provided.
es: Tenga en cuenta que el segundo enfoque requerirá que la API mantenga un historial de revisión completo de cada proceso de contratación, de manera que se puedan proporcionar las entregas de cada etapa de un proceso de contratación.

source: Publishers should consider how to [ensure URIs can remain stable](https://www.w3.org/Provider/Style/URI.html), even across a change of systems.
es: Los publicadores deben considerar cómo [asegurar que los URIs puedan permanecer estables](https://www.w3.org/Provider/Style/URI.html), incluso a través de un cambio de sistemas.

source: Flattened serializations
es: Serializaciones planas

source: The [serialization](../../serialization/) page provides details of how to generate 'flat' versions of OCDS data for use in spreadsheet software.
es: La página [serialización](../../serialization/) proporciona detalles sobre cómo generar versiones "planas" de datos OCDS para su uso en un software de hoja de cálculo.

source: The same principles discussed for bulk files above should be applied to CSV or Excel downloads of data.
es: Los mismos principios discutidos para los archivos de descarga masiva anteriores deben aplicarse a las descargas de datos CSV o Excel.

source: Discovery and APIs
es: Descubrimiento y APIs

source: There are many thousands of organisations who should be able to publish Open Contracting data. As a result, maintaining a central registry of all published data is impractical. Instead, OCDS proposes a common pattern for the discovery of Open Contracting data releases and records.
es: Hay miles de organizaciones que deberían ser capaces de publicar Datos de Contrataciones Abiertas. Como resultado, no es práctico mantener un registro central de todos los datos publicados. En cambio, OCDS propone un patrón común para el descubrimiento de entregas y registros de Datos de Contrataciones Abiertas.

source: For the discovery of bulk datasets, and the location of any data feeds, we propose use of a data.json file.
es: Para el descubrimiento de conjuntos de datos masivos y la ubicación de cualquier fuente de datos, se propone el uso de un archivo data.json.

source: For the discovery of individual releases and records, we propose use atom feeds.
es: Para el descubrimiento de versiones y registros individuales, se propone utilizar feeds de atom.

source: There is a [community discussion here](https://github.com/open-contracting/standard/issues/290) on whether OCDS should include a proposed API standard in future iterations.
es: Hay una [discusión de la comunidad aquí](https://github.com/open-contracting/standard/issues/290) sobre si OCDS debe incluir un estándar de API propuesto en futuras iteraciones.

source: Dataset and feed discovery
es: Conjunto de datos y descubrimiento de feeds

source: Publishers should provide a data.json document describing the location of all of the bulk OCDS files available for download.
es: Los publicadores deben proporcionar un documento data.json que describa la ubicación de todos los archivos para descarga masiva de OCDS disponibles.

source: This should follow the structure proposed by the [US Project Open Data](https://project-open-data.github.io/schema/) with:
es: Esto debe seguir la estructura propuesta por [US Project Open Data](https://project-open-data.github.io/schema/) con:

source: Each record containing a distribution block with at least one accessURL pointing to OCDS data.
es: Cada registro que contiene un bloque de distribución con al menos un accessURL apuntando a los datos OCDS.

source: Each record containing 'open-contracting-data', and either 'open-contracting-release' or 'open-contracting-record' in the keyword array.
es: Cada registro que contiene 'open-contracting-data' y 'open-contracting-release' o 'open-contracting-record' en la matriz de palabras clave.

source: accessLevel set appropriately
es: accessLevel configurado adecuadamente

source: In addition, the data.json document may contain one or more records with the keyword 'open-contracting-feed' and either 'open-contracting-release' or 'open-contracting-record' and pointing via an accessURL in their distribution block to an atom feed document.
es: Además, el documento data.json puede contener uno o más registros con la palabra clave 'open-contracting-feed' y 'open-contracting-release' u 'open-contracting-record' y apuntando a través de un accessURL en su bloque de distribución a un documento de feed de átomos.

source: Publishers exposing individual records and releases, of regularly updated data packages in small sets, should provide one or more [atom feeds](http://en.wikipedia.org/wiki/Atom_%28standard%29) that index these, and provide an easy mechanism for users to discover recently published or updated release and records.
es: Los publicadores que expongan registros individuales y entregas, de paquetes de datos actualizados regularmente en pequeños conjuntos, deben proporcionar uno o más [atom feeds](http://en.wikipedia.org/wiki/Atom_%28standard%29) que indexan estos y proporcionan un fácil mecanismo para que los usuarios descubran publicaciones y registros recientemente publicados o actualizados.

source: The link to the release or record should be provided via a ```<link>``` tag, and the updated date of the entry should reflect the updated date of that release or record. The ```<id>``` should reflect the release id for release, or the ocid for records.
es: El vínculo con la entrega o el registro debe proporcionarse mediante una etiqueta ```<link>```, y la fecha actualizada de la entrada debe reflejar la fecha actualizada de dicha entrega o registro. El ```<id>``` debería reflejar el id de la entrega para la entrega, o el ocid para los registros.

source: The release.tag should be contained within an ```<category>``` element of the feed.
es: El release.tag debe estar contenido dentro de un elemento ```<category>``` del feed.

source: Feeds requiring pagination should follow the approach set out in [RFC 5005](https://tools.ietf.org/html/rfc5005#section-3).
es: Los feeds que requieren paginación deben seguir el enfoque establecido en [RFC 5005](https://tools.ietf.org/html/rfc5005#section-3).

source: Future implementations of OCDS will explore use of the <a href="http://tools.ietf.org/html/rfc5785">/.well-known/</a> protocol to declare a location for storing a data.json file.
es: Las futuras implementaciones de OCDS explorarán el uso del protocolo <a href="http://tools.ietf.org/html/rfc5785">/.well-known/</a> para declarar una ubicación para almacenar un archivo data.json.

source: At present, such files can be hosted anywhere, and consuming applications pointed towards them manually.
es: En la actualidad, tales archivos pueden ser alojados en cualquier lugar, y las aplicaciones de consumo apuntadas hacia ellos manualmente.

source: The data.json structure has been chosen to allow organisations following this approach to include tagged 'open-contracting-data' within their existing data discovery mechanisms, and given the availability of a plugin for the widely used CKAN which will also support exposure of data.json files.
es: La estructura data.json ha sido elegida para permitir que las organizaciones que sigan este enfoque incluyan 'open-contracting-data' etiquetada dentro de sus mecanismos de descubrimiento de datos existentes y dada la disponibilidad de un complemento para el CKAN ampliamente utilizado, que también impulsará la exposición de archivos de data.json.

source: Linking data
es: Vinculación de datos

source: For 5 ☆ publication of OCDS data, publishers should seek to use URIs in their datasets, linking to other machine-readable data sources at an entity-by-entity level.
es: Para el nivel 5 ☆ publicación de datos OCDS, los publicadores deben tratar de usar URIs en sus bases de datos, enlazando a otras fuentes de datos legibles por máquina en un nivel entidad por entidad.
