Repository: ngm/standard
Catalog: standard/docs/locale/*/LC_MESSAGES/getting_started/contracting_process.po
Languages: es

source: The Contracting Process
es: El Proceso de Contratación

source: There are several stages to a contracting process.
es: Hay varias etapas en un proceso de contratación.

source: OCDS covers:
es: El OCDS cubre:

source: ![Tender](../../../assets/green_planning.svg.png)
es: ![Licitación](../../../assets/green_planning.svg.png)

source: **Planning**<br/> *Including:*<br/> Budgets<br/> Project plans<br/> Procurement plans<br/> Market studies<br/> Public hearing info<br/>
es: **Planeación** <br/> *Incluyendo:* <br/> Presupuestos <br/> Planes de proyecto <br/> Planes de adquisición <br/> Estudios de mercado <br/> Información de audiencia pública <br/>

source: ![Tender](../../../assets/green_tendering.svg.png)
es: ![Licitación](../../../assets/green_tendering.svg.png)

source: **Initiation (Tender)**<br/> *Including:*<br/> Tender notices<br/> Specifications<br/> Line items<br/> Values<br/> Enquiries
es: ** Iniciación(oferta)** <br/> *Incluye:* <br/> Avisos de licitación <br/> Especificaciones <br/> Partidas <br/> Valores <br/> Consultas

source: ![Award](../../../assets/green_awarded.svg.png)
es: ![Adjudicación](../../../assets/green_awarded.svg.png)

source: **Award**<br/> *Including:*<br/> Details of award<br/> Bidder information<br/> Bid evaluation<br/> Values
es: **Adjudicación** <br/> *Incluye:* <br/> Detalles del adjudicación <br/> Información del licitante <br/> Evaluación de la oferta <br/> Valores

source: ![Contract](../../../assets/green_signed.svg.png)
es: ![Contrato](../../../assets/green_signed.svg.png)

source: **Contract**<br/> *Including:*<br/> Final details<br/> Signed contract<br/> Amendments<br/> Values
es: **Contrato** <br/> *Incluye:* <br/> Detalles finales <br/> Contrato firmado <br/> Enmiendas <br/> Valores

source: ![Implementation](../../../assets/green_implementation.svg.png)
es: ![Implementación](../../../assets/green_implementation.svg.png)

source: **Implementation**<br/> *Including:*<br/> Payments<br/> Progress updates<br/> Location<br/> Extensions<br/> Amendments<br/> Completion or Termination info
es: **Implementación** <br/> *Incluye:* <br/> Pagos <br/> Actualizaciones de progreso <br/> Ubicación <br/> Extensiones <br/> Enmiendas <br/> Información de finalización o terminación

source: Not all contracting processes have all stages. For example, direct contracting may start with the award of a contract. However, there will still be information that can be disclosed about the budgets, specifications and selection process even in this case.
es: No todos los procesos de contratación tienen todas las etapas. Por ejemplo, la contratación directa puede comenzar con la adjudicación de un contrato. Sin embargo, todavía habrá información que se pueda divulgar sobre los presupuestos, las especificaciones y el proceso de selección incluso en este caso.

source: You should aim to publish OCDS data close to real-time: releasing data as each stage of a contracting process takes place.
es: Usted debe tratar de publicar los datos de OCDS lo más cerca a tiempo real: libere los datos a medida que cada etapa de un proceso de contratación se vaya llevando a cabo.

source: This may involve generating output from a range of different systems. Data published from different systems can be tied together by use of a common Open Contracting ID (```ocid```).
es: Esto puede implicar generar la salida de una serie de sistemas diferentes. Los datos publicados de diferentes sistemas se pueden unir mediante el uso de un ID de contratación abierta común (```ocid``).

source: Defining a contracting process
es: Definición de un proceso de contratación

source: For public procurement OCDS defines a unique contracting process as:
es: Para la contratación pública OCDS define un proceso de contratación único como:

source: All the planning, tendering information, awards, contracts and contract implementation information related to a single initiation process.
es: Toda la información relativa a la planeación, la licitación, las adjudicaciones, los contratos y la ejecución de contratos relacionados con un solo proceso de iniciación.

source: An initiation process may be a tender, a direct contract award, or a call to award a concession.
es: Un proceso de iniciación puede ser una licitación, un contrato directo o una convocatoria para otorgar una concesión.

source: The Open Contracting ID (ocid)
es: El Open Contracting ID (ocid)

source: Each unique contracting process should be assigned an ```ocid```. This is an identifier which can be used to join up data between different stages (as often the data may be stored in different systems).
es: A cada proceso de contratación exclusivo se le debe asignar un ```ocid```. Este es un identificador que se puede utilizar para unir datos entre diferentes etapas (ya que con frecuencia los datos pueden almacenarse en diferentes sistemas).

source: To make sure the ```ocid```s assigned by two different publishers do not clash, publishers are encouraged to register a publisher prefix. This can be prepended onto locally generated identifiers, giving a globally unique identifier, and allowing disparate data sources to confidently refer to a unique contracting process.
es: Para asegurarse de que los ```ocid```s asignados por dos publicadores diferentes no chocan, se recomienda a los publicadores que registren un prefijo de publicador. Esto puede añadirse previamente a identificadores generados localmente, proporcionando un identificador globalmente único y permitiendo que fuentes de datos dispares se refieran a un proceso de contratación único.

source: You can [register your ocid prefix here](../implementation/registration.md).
es: Usted puede [registrar su prefijo de ocid aquí](../implementation/registration.md).

source: In [Mexico City](http://www.contratosabiertos.cdmx.gob.mx/), an initial mapping identified that identifiers were assigned to each tender process or direct award, using a pattern based on the initials or name of the department involved, a tender or contract number, and the year.
es: En [Ciudad de México](http://www.contratosabiertos.cdmx.gob.mx/), un mapeo inicial identificó que se asignaron identificadores a cada proceso de licitación o adjudicación directa, utilizando un patrón basado en las iniciales o el nombre del departamento, un número de licitación o de contrato, y el año.

source: For example:
es: Por ejemplo:

source: These identifiers uniquely identify each contracting process. Fields and business processes to capture these identifiers at each contracting process stage were added to the relevant systems.
es: Estos identificadores identifican de manera única cada proceso de contratación. Los campos y los procesos empresariales para capturar estos identificadores en cada etapa del proceso de contratación se agregaron a los sistemas pertinentes.

source: Mexico City then registered a prefix with the OCDS helpdesk. They have been given the prefix 'ocds-87sd3t' which can be added to their unique process identifiers to give a globally unique ocid.
es: La Ciudad de México registró un prefijo con el helpdesk de OCDS. Se les ha dado el prefijo 'ocds-87sd3t' que se puede agregar a sus identificadores de procesos únicos para dar un ocid globalmente único.

source: All the award notices, contracts and transactions resulting from the tender with this identifier should also share this ocid - allowing Mexico City to bring together a complete picture of each contracting process.
es: Todos los avisos de adjudicación, contratos y transacciones resultantes de la licitación con este identificador también deben compartir este ocid - lo que permite a la Ciudad de México reunir una visión completa de cada proceso de contratación.

source: The ```ocid``` is case sensitive. Case should be used consistently whenever an ```ocid``` is presented.
es: El ```ocid``` distingue entre mayúsculas y minúsculas. Éstas deben utilizarse de forma consistente siempre que se presente un ```ocid```.

source: Mapping your systems
es: Mapeo de sus sistemas

source: The Open Contracting Data Standard helpdesk provide [a technical assessment template](http://www.open-contracting.org/resources/ocds-technical-assessment-template/) that can be used to identify the different systems involved in managing data on each stage of the contracting process.
es: El Helpdesk del Estándar de Datos de Contrataciones Abiertas proporciona [una plantilla de evaluación técnica](http://www.open-contracting.org/resources/ocds-technical-assessment-template/) que puede utilizarse para identificar los diferentes sistemas implicados en la gestión de datos en cada etapa del proceso de contratación.
